package consts

const (
	DemoMsg1 = "エビフライはとても良い言葉ですね！ところで、デモモードについて知っていますか？デモモードは、このアプリの機能を試すためのモードです。デモモードでは、ユースケース層の処理をスキップして、固定のレスポンスを返します。"
	DemoMsg2 = "デモモードを使うと、アプリの基本的な挙動を素早く確認できます。実際のビジネスロジックを通さずにテストできるので、デバッグやデモに最適です。"
	DemoMsg3 = "デモモードの利点として、エラーが起きにくい点も挙げられます。意図しない例外や外部サービスへの接続が不要になるため、トラブルシューティングが容易になります。"
	DemoMsg4 = "もちろん、デモモードをオフにすることも簡単です。アプリを本番環境で動作させるときは、ユースケース層の処理を正しく通す設定にしておくのをお忘れなく。"
	DemoMsg5 = "デモモードの使い方は簡単です。チェックボックスを有効にするだけです。おっと、このメッセージをみれているということは、デモモードはすでに有効になっているようですね。"
	DemoMsg6 = "デモモードを無効にするには、チェックボックスを無効にしてください。"
)
